ryankurte/efm32-base/hardware/kit/common/drivers/sl_efpdrv.c
/***************************************************************************//**
 * @file
 * @brief EFP (Energy Friendly PMIC) driver.
 * @version 5.7.0
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.  This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/
#include "em_assert.h"
#include "em_common.h"
#include "em_core.h"
#include "em_gpio.h"
#include "sl_efpdrv.h"

#include <stdbool.h>
#include <math.h>

/**************************************************************************//**
* @addtogroup kitdrv
* @{
******************************************************************************/

/* *INDENT-OFF* */
/***************************************************************************//**
 * @addtogroup SL_EFPDRV
 * @brief EFP (Energy Friendly PMIC) driver.
 * @{

   @note This version of the sl_efpdrv is Alpha level only. Silicon Labs will
   NOT support any production deployments with this Alpha version.
   Production deployments will only be supported with the GA version of this
   feature. This version is intended for lab and evaluation purpose only.

   @details
   Documentation placeholder.
 ******************************************************************************/
/* *INDENT-ON* */

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#define EFPDRV_EFP01_I2C_ADDR   0x60

enum {
  em_transition_mode_i2c = 0,
  em_transition_mode_gpio,
  em_transition_mode_emu
} em_transition_mode;

#if defined(SL_EFPDRV_EM_CTRL_GPIO_BITBANG) || defined(SL_EFPDRV_EM_CTRL_I2C)
static CORE_DECLARE_IRQ_STATE;
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
static unsigned int i2c_instance_index;
#endif

static bool in_direct_mode;
static sl_efpdrv_init_data init_data;

/***************************************************************************//**
 * @brief
 *   Configure I2C GPIO pins.
 *
 * @param[in] enable
 *   If true configure I2C pins for I2C use, if false pins are configured as
 *   GPIO pins to enable "direct mode" EM transfer mode.
 ******************************************************************************/
static void enable_i2c_pins(bool enable)
{
  if (enable) {
    in_direct_mode = false;
    GPIO_PinModeSet(init_data.i2c_sda_port, init_data.i2c_sda_pin,
                    gpioModeWiredAnd, 1);
    GPIO_PinModeSet(init_data.i2c_scl_port, init_data.i2c_scl_pin,
                    gpioModeWiredAnd, 1);

#if defined(_SILICON_LABS_32B_SERIES_0)
    init_data.i2c_instance->ROUTE |= I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN;
#elif defined(_SILICON_LABS_32B_SERIES_1)
    init_data.i2c_instance->ROUTEPEN |= I2C_ROUTEPEN_SDAPEN | I2C_ROUTEPEN_SCLPEN;
#elif defined(_SILICON_LABS_32B_SERIES_2)
    GPIO->I2CROUTE[i2c_instance_index].ROUTEEN |= GPIO_I2C_ROUTEEN_SDAPEN
                                                  | GPIO_I2C_ROUTEEN_SCLPEN;
#endif
  } else {
    in_direct_mode = true;
    GPIO_PinModeSet(init_data.i2c_sda_port, init_data.i2c_sda_pin,
                    gpioModePushPull, 1);
    GPIO_PinModeSet(init_data.i2c_scl_port, init_data.i2c_scl_pin,
                    gpioModePushPull, 1);

#if defined(_SILICON_LABS_32B_SERIES_0)
    init_data.i2c_instance->ROUTE &= ~(I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN);
#elif defined(_SILICON_LABS_32B_SERIES_1)
    init_data.i2c_instance->ROUTEPEN &= ~(I2C_ROUTEPEN_SDAPEN
                                          | I2C_ROUTEPEN_SCLPEN);
#elif defined(_SILICON_LABS_32B_SERIES_2)
    GPIO->I2CROUTE[i2c_instance_index].ROUTEEN &= ~(GPIO_I2C_ROUTEEN_SDAPEN
                                                    | GPIO_I2C_ROUTEEN_SCLPEN);
#endif
  }
}

/***************************************************************************//**
 * @brief
 *   Perform a VDD measurement.
 *
 * @param[in] msn_addr
 *   Register address of most significant byte of measurement.
 *
 * @param[in] lsby_addr
 *   Register address of least significant byte of measurement.
 *
 * @param[out] voltage_mv
 *   The result of the VDD measurement.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int get_vdd(uint8_t msn_addr, uint8_t lsby_addr, uint16_t *voltage_mv)
{
  int ret_val;
  uint16_t read_value;
  uint8_t adc_cc_ctrl, tmp, ss_mode;

  // Get ADC_INTERVAL value.
  ret_val = sl_efpdrv_read_register(EFP01_ADC_CC_CTRL, &adc_cc_ctrl);

  if (ret_val == SL_EFPDRV_OK) {
    if ((adc_cc_ctrl & _EFP01_ADC_CC_CTRL_ADC_INTERVAL_MASK) == 0) {
      // Issue an ADC start command if automated measurements are not enabled.
      ret_val = sl_efpdrv_write_register_field(EFP01_CMD,
                                               1,
                                               _EFP01_CMD_ADC_START_MASK,
                                               _EFP01_CMD_ADC_START_SHIFT);
    }
  }

  // Wait at least 18.5 usec for the result, read of SS mode provides the delay.
  if (ret_val == SL_EFPDRV_OK) {
    ret_val = sl_efpdrv_read_register(EFP01_CC_MODE, &ss_mode);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Read result MSB.
    ret_val = sl_efpdrv_read_register(msn_addr, &tmp);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Read result LSB.
    read_value = tmp << 8;
    ret_val = sl_efpdrv_read_register(lsby_addr, &tmp);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Scale result correctly.
    read_value |= tmp;
    if (ss_mode & _EFP01_CC_MODE_SC_MODE_MASK) {
      // Result is a VDDA measurement.
      *voltage_mv = (uint16_t)lroundf(read_value * 1.01f);
    } else {
      // Result is a VDDB measurement.
      *voltage_mv = (uint16_t)lroundf(read_value * 1.49f);
    }
  }

