ryankurte/efm32-base/hardware/kit/common/drivers/sl_efpdrv.c
  return ret_val;
}

/// @endcond

#if defined(SL_EFPDRV_EM_CTRL_GPIO_BITBANG) || defined(SL_EFPDRV_EM_CTRL_I2C)
/***************************************************************************//**
 * @brief
 *   Reimplementation of EMU function with same name.
 *
 * @details
 *   This function will be called upon wakeup from the _WFI() instruction in
 *   EMU_EnterEM2/3() functions, and will set the EFP in EM0 mode.
 *   A critical section is used to get predictable EFP energy mode sequence
 *   timing.
 ******************************************************************************/
void EMU_EM23PostsleepHook(void)
{
  sl_efpdrv_enter_em0();
  CORE_EXIT_CRITICAL();
}
#endif

#if defined(SL_EFPDRV_EM_CTRL_GPIO_BITBANG) || defined(SL_EFPDRV_EM_CTRL_I2C)
/***************************************************************************//**
 * @brief
 *   Reimplementation of EMU function with same name.
 *
 * @details
 *   This function will be called prior to the _WFI() instruction in
 *   EMU_EnterEM2/3() functions, and will set the EFP in EM2 mode.
 *   A critical section is used to get predictable EFP energy mode sequence
 *   timing.
 ******************************************************************************/
void EMU_EM23PresleepHook(void)
{
  CORE_ENTER_CRITICAL();
  sl_efpdrv_enter_em2();
}
#endif

/***************************************************************************//**
 * @brief
 *   Configure I2C GPIO pins for "direct mode" EM transfer mode.
 *
 * @note
 *   This must be the last EFP driver function called prior to entering EM2/3
 *   via EMU_EnterEMx() calls. Any EFP API call that involves an I2C transfer
 *   will leave the I2C GPIO pins in I2C mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_enable_direct_mode(void)
{
  return sl_efpdrv_enter_em0();
}

/***************************************************************************//**
 * @brief
 *   Set EFP in EM0 energy mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_enter_em0(void)
{
  int ret_val = SL_EFPDRV_OK;

  if (em_transition_mode == em_transition_mode_gpio) {
    if (!in_direct_mode) {
      ret_val = sl_efpdrv_write_register_field(EFP01_EM_CRSREG_CTRL,
                                               1 << _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_SHIFT,
                                               _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_MASK,
                                               _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_SHIFT);
      enable_i2c_pins(false);
    }
    GPIO_PinOutSet(init_data.i2c_scl_port, init_data.i2c_scl_pin);
  } else if (em_transition_mode == em_transition_mode_i2c) {
    ret_val = sl_efpdrv_write_register_field(EFP01_EM_CRSREG_CTRL,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_EM0,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_MASK,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_SHIFT);
  }
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Set EFP in EM2 energy mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_enter_em2(void)
{
  int ret_val = SL_EFPDRV_OK;

  if (em_transition_mode == em_transition_mode_gpio) {
    if (!in_direct_mode) {
      ret_val = sl_efpdrv_write_register_field(EFP01_EM_CRSREG_CTRL,
                                               1 << _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_SHIFT,
                                               _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_MASK,
                                               _EFP01_EM_CRSREG_CTRL_EM_DIRECTEN_SHIFT);
      enable_i2c_pins(false);
    }
    GPIO_PinOutClear(init_data.i2c_scl_port, init_data.i2c_scl_pin);
  } else if (em_transition_mode == em_transition_mode_i2c) {
    ret_val = sl_efpdrv_write_register_field(EFP01_EM_CRSREG_CTRL,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_EM2,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_MASK,
                                             _EFP01_EM_CRSREG_CTRL_EM_STSEL_SHIFT);
  }
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Measure average VDD.
 *
 * @note
 *   This function will measure VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[out] voltage_mv
 *   Average VDD voltage expressed in miilivolts.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_get_vdd_avg(uint16_t *voltage_mv)
{
  return get_vdd(EFP01_VDD_AVG_MSN, EFP01_VDD_AVG_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Measure maximum VDD.
 *
 * @note
 *   This function will measure VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[out] voltage_mv
 *   Maximum VDD voltage expressed in miilivolts.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_get_vdd_max(uint16_t *voltage_mv)
{
  return get_vdd(EFP01_VDD_MAX_MSN, EFP01_VDD_MAX_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Measure minimum VDD.
 *
 * @note
 *   This function will measure VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[out] voltage_mv
 *   Minimum VDD voltage expressed in miilivolts.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_get_vdd_min(uint16_t *voltage_mv)
{
  return get_vdd(EFP01_VDD_MIN_MSN, EFP01_VDD_MIN_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Initialize EFP driver and configure underlying EFP hardware.
 *
 * @param[in] init
 *   Initialization data structure.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_init(const sl_efpdrv_init_data *init)
{
  uint8_t *p;
  int ret_val, i;
  init_data = *init;

  // Assemble an I2C SPM initialization structure.
  I2CSPM_Init_TypeDef i2c_init = {
    .port            = init->i2c_instance,
    .sclPort         = init->i2c_scl_port,
    .sclPin          = init->i2c_scl_pin,
    .sdaPort         = init->i2c_sda_port,
    .sdaPin          = init->i2c_sda_pin,
#if defined(_SILICON_LABS_32B_SERIES_0)
    .portLocation;   = init->i2c_port_location,
#elif defined(_SILICON_LABS_32B_SERIES_1)
    .portLocationScl = init->i2c_scl_port_location,
    .portLocationSda = init->i2c_sda_port_location,
#endif
    .i2cRefFreq      = 0,
    .i2cMaxFreq      = I2C_FREQ_FASTPLUS_MAX,
    .i2cClhr         = i2cClockHLRStandard
  };

