ryankurte/efm32-base/hardware/kit/common/drivers/sl_efpdrv.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  if ( false ) {
#if defined(I2C0)
  } else if (init->i2c_instance == I2C0) {
    i2c_instance_index = 0;
#endif
#if defined(I2C1)
  } else if (init->i2c_instance == I2C1) {
    i2c_instance_index = 1;
#endif
#if defined(I2C2)
  } else if (init->i2c_instance == I2C2) {
    i2c_instance_index = 2;
#endif
  }
#endif

#if defined(SL_EFPDRV_EM_CTRL_GPIO_BITBANG)
  em_transition_mode = em_transition_mode_gpio;
#elif defined(SL_EFPDRV_EM_CTRL_I2C)
  em_transition_mode = em_transition_mode_i2c;
#elif defined(SL_EFPDRV_EM_CTRL_EMU)
  em_transition_mode = em_transition_mode_emu;
#else
  #error "Illegal EFPDRV configuration"
#endif

  // Initialize I2C interface.
  I2CSPM_Init(&i2c_init);
  in_direct_mode = false;
  // Set I2C slow mode and enable internal pullups.
  ret_val = sl_efpdrv_write_register(EFP01_I2C_CTRL,
                                     (1 << _EFP01_I2C_CTRL_I2C_PU_SHIFT)
                                     | (1 << _EFP01_I2C_CTRL_IO_SLOW_MODE_SHIFT));
  enable_i2c_pins(true);

  // Do configuration register writes if a configuration is defined.
  if (init->config_size > 0) {
    i = init->config_size;
    p = init->config_data;
    while (i && (ret_val == SL_EFPDRV_OK)) {
      ret_val = sl_efpdrv_write_register(*p, *(p + 1));
      i--;
      p += 2;
    }
  }

  // Configure GPIO pin as EFP IRQ input.
  if ((init->enable_irq_pin) && (ret_val == SL_EFPDRV_OK)) {
    uint8_t tmp;
    // Clear interrupt flags.
    ret_val  = sl_efpdrv_read_register(EFP01_STATUS_G, &tmp);
    ret_val |= sl_efpdrv_write_register(EFP01_STATUS_G, tmp);
    ret_val |= sl_efpdrv_read_register(EFP01_STATUS_V, &tmp);
    ret_val |= sl_efpdrv_write_register(EFP01_STATUS_V, tmp);
    if (ret_val == SL_EFPDRV_OK) {
      GPIO_PinModeSet(init->irq_port, init->irq_pin, gpioModeInputPull, 1);
    }
  }

  // Prepare for GPIO bitbanged "direct mode" EM transitions.
  if ((em_transition_mode == em_transition_mode_gpio)
      && (ret_val == SL_EFPDRV_OK)) {
    // Prepare GPIO for bitbang use.
    ret_val = sl_efpdrv_enable_direct_mode();
  }

  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Read EFP OTP register.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[out] data
 *   The value read from the OTP register.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_read_otp(uint8_t addr, uint8_t *data)
{
  int ret_val;
  uint8_t read_value;

  ret_val = sl_efpdrv_write_register(0x0F, 0x06);   // Enable OTP access.

  if (ret_val == SL_EFPDRV_OK) { // Need a few us delay, use reg. read as delay.
    ret_val = sl_efpdrv_read_register(EFP01_OTP_STATCTRL, &read_value);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Setup OTP address.
    ret_val = sl_efpdrv_write_register(EFP01_OTP_ADDR, addr & 0x7F);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Issue OTP read command.
    ret_val = sl_efpdrv_write_register_field(EFP01_OTP_STATCTRL,
                                             1,
                                             _EFP01_OTP_STATCTRL_CMD_READOTP_MASK,
                                             _EFP01_OTP_STATCTRL_CMD_READOTP_SHIFT);
  }

  if (ret_val == SL_EFPDRV_OK) { // Need a few us delay, use reg. read as delay.
    ret_val = sl_efpdrv_read_register(EFP01_OTP_STATCTRL, &read_value);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Readout OTP data.
    ret_val = sl_efpdrv_read_register(EFP01_OTP_RDATA, &read_value);
  }

  if (ret_val == SL_EFPDRV_OK) {                    // Disable OTP access.
    *data = read_value;                             // OTP value.
    ret_val = sl_efpdrv_write_register(0x0F, 0x00);
  }

  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Read EFP control register.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[out] data
 *   The value read from the register.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_read_register(uint8_t addr, uint8_t *data)
{
  uint8_t read_value;

  I2C_TransferSeq_TypeDef seq = {
    .addr   = EFPDRV_EFP01_I2C_ADDR,
    .flags  = I2C_FLAG_WRITE_READ,
    .buf[0] = { .data = &addr, .len = 1 },
    .buf[1] = { .data = &read_value, .len = 1 }
  };

  if (in_direct_mode) {
    enable_i2c_pins(true);
  }

  if (I2CSPM_Transfer(init_data.i2c_instance, &seq) != i2cTransferDone) {
    EFM_ASSERT(false);
    return SL_EFPDRV_I2C_ERROR;
  }
  *data = read_value;
  return SL_EFPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *   Read EFP control register field.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[out] data
 *   The value read from the register field.
 *
 * @param[in] mask
 *   Bit mask corresponding to target bit field.
 *
 * @param[in] pos
 *   Bit number of least significant bit of target bit field.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_read_register_field(uint8_t addr,
                                  uint8_t *data,
                                  uint8_t mask,
                                  uint8_t pos)
{
  int ret_val;
  uint8_t tmp;

  ret_val = sl_efpdrv_read_register(addr, &tmp);
  if (ret_val == SL_EFPDRV_OK) {
    *data = (tmp & mask) >> pos;
  }
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOA EM01 peak output current.
 *
 * @param[in] current_ma
 *   Target peak current expressed in milliamperes.
 *
 * @param[in] vddb_mv
 *   VDDB expressed in millivolt.
 *
 * @param[in] voa_mv
 *   VOA expressed in millivolt.
 *
 * @param[in] inductor_nh
 *   Inductor size expressed in nanohenry.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voa_em01_peak_current(unsigned int current_ma,
                                        unsigned int vddb_mv,
                                        unsigned int voa_mv,
                                        unsigned int inductor_nh)
{
  long l;
  float f;

  f = (current_ma - 90.0f - (25.0f * (vddb_mv - voa_mv) / inductor_nh)) / 9.0f;
  l = lroundf(f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_BB_IPK_BB_IPK_MASK >> _EFP01_BB_IPK_BB_IPK_SHIFT);

