ryankurte/efm32-base/hardware/kit/common/drivers/sl_efpdrv.c
  return sl_efpdrv_write_register_field(EFP01_BB_IPK, (uint8_t)l,
                                        _EFP01_BB_IPK_BB_IPK_MASK,
                                        _EFP01_BB_IPK_BB_IPK_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOA EM23 peak output current.
 *
 * @param[in] current_ma
 *   Target peak current expressed in milliamperes.
 *
 * @param[in] vddb_mv
 *   VDDB expressed in millivolt.
 *
 * @param[in] voa_mv
 *   VOA expressed in millivolt.
 *
 * @param[in] inductor_nh
 *   Inductor size expressed in nanohenry.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voa_em23_peak_current(unsigned int current_ma,
                                        unsigned int vddb_mv,
                                        unsigned int voa_mv,
                                        unsigned int inductor_nh)
{
  long l;
  float f;

  f = (current_ma - 108.0f - (25.0f * (vddb_mv - voa_mv) / inductor_nh)) / 36.0f;
  l = lroundf(f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_BB_IPK_BB_IPK_EM2_MASK >> _EFP01_BB_IPK_BB_IPK_EM2_SHIFT);

  return sl_efpdrv_write_register_field(EFP01_BB_IPK, (uint8_t)l,
                                        _EFP01_BB_IPK_BB_IPK_EM2_MASK,
                                        _EFP01_BB_IPK_BB_IPK_EM2_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOA mode.
 *
 * @param[in] mode
 *   Regulator mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voa_mode(sl_efpdrv_voa_mode_t mode)
{
  return sl_efpdrv_write_register_field(EFP01_BB_CTRL3,
                                        mode,
                                        _EFP01_BB_CTRL3_BB_MODE_MASK,
                                        _EFP01_BB_CTRL3_BB_MODE_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOA output voltage.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voa_voltage(unsigned int voltage_mv)
{
  uint8_t voa = (uint8_t)lroundf((voltage_mv - 1737.4f) / 30.6f)
                & _EFP01_VOA_V_VOA_V_MASK;
  return sl_efpdrv_write_register(EFP01_VOA_V, voa);
}

/***************************************************************************//**
 * @brief
 *   Set VOA SW (switched output) mode.
 *
 * @param[in] mode
 *   VOA SW mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voa_sw_mode(sl_efpdrv_voa_sw_mode_t mode)
{
  return sl_efpdrv_write_register_field(EFP01_BIAS_SW,
                                        mode,
                                        _EFP01_BIAS_SW_VOA_SW_CON_MASK,
                                        _EFP01_BIAS_SW_VOA_SW_CON_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM01 peak output current.
 *
 * @param[in] current_ma
 *   Target peak current expressed in milliamperes.
 *
 * @param[in] vddb_mv
 *   VDDB expressed in millivolt.
 *
 * @param[in] vob_mv
 *   VOB expressed in millivolt.
 *
 * @param[in] inductor_nh
 *   Inductor size expressed in nanohenry.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_vob_em01_peak_current(unsigned int current_ma,
                                        unsigned int vddb_mv,
                                        unsigned int vob_mv,
                                        unsigned int inductor_nh)
{
  long l;
  float f;

  f = (current_ma - 90.0f - (25.0f * (vddb_mv - vob_mv) / inductor_nh)) / 9.0f;
  l = lroundf(f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_BK_IPK_BK_IPK_MASK >> _EFP01_BK_IPK_BK_IPK_SHIFT);

  return sl_efpdrv_write_register_field(EFP01_BK_IPK, (uint8_t)l,
                                        _EFP01_BK_IPK_BK_IPK_MASK,
                                        _EFP01_BK_IPK_BK_IPK_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM01 output voltage.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_vob_em01_voltage(unsigned int voltage_mv)
{
  uint8_t vob = (uint8_t)lroundf((voltage_mv - 809.5f) / 22.3f);
  return sl_efpdrv_write_register_field(EFP01_VOB_EM0_V, vob,
                                        _EFP01_VOB_EM0_V_VOB_EM0_V_MASK,
                                        _EFP01_VOB_EM0_V_VOB_EM0_V_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM23 peak output current.
 *
 * @param[in] current_ma
 *   Target peak current expressed in milliamperes.
 *
 * @param[in] vddb_mv
 *   VDDB expressed in millivolt.
 *
 * @param[in] vob_mv
 *   VOB expressed in millivolt.
 *
 * @param[in] inductor_nh
 *   Inductor size expressed in nanohenry.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_vob_em23_peak_current(unsigned int current_ma,
                                        unsigned int vddb_mv,
                                        unsigned int vob_mv,
                                        unsigned int inductor_nh)
{
  long l;
  float f;

  f = (current_ma - 108.0f - (25.0f * (vddb_mv - vob_mv) / inductor_nh)) / 36.0f;
  l = lroundf(f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_BK_IPK_BK_IPK_EM2_MASK >> _EFP01_BK_IPK_BK_IPK_EM2_SHIFT);

  return sl_efpdrv_write_register_field(EFP01_BK_IPK, (uint8_t)l,
                                        _EFP01_BK_IPK_BK_IPK_EM2_MASK,
                                        _EFP01_BK_IPK_BK_IPK_EM2_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM23 output voltage.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_vob_em23_voltage(unsigned int voltage_mv)
{
  uint8_t vob = (uint8_t)lroundf((voltage_mv - 809.5f) / 22.3f)
                & _EFP01_VOB_EM2_V_VOB_EM2_V_MASK;
  return sl_efpdrv_write_register(EFP01_VOB_EM2_V, vob);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB mode.
 *
 * @param[in] mode
 *   Regulator mode.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_vob_mode(sl_efpdrv_vob_mode_t mode)
{
  return sl_efpdrv_write_register_field(EFP01_BK_CTRL1,
                                        mode,
                                        _EFP01_BK_CTRL1_BK_MODE_MASK,
                                        _EFP01_BK_CTRL1_BK_MODE_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOC output voltage.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_set_voc_voltage(unsigned int voltage_mv)
{
  uint8_t voc = (uint8_t)lroundf((voltage_mv - 1717.8f) / 30.5f)
                & _EFP01_VOC_V_VOC_V_MASK;
  return sl_efpdrv_write_register(EFP01_VOC_V, voc);
}

/***************************************************************************//**
 * @brief
 *   Turn off the internal EMU LDO that supplies DECOUPLE pin.
 *
 * @note
 *   Make sure that an external source supply the DECOUPLE pin before calling
 *   this function.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_NOT_SUPPORTED.
 ******************************************************************************/
int sl_efpdrv_shutdown_emu_ldo(void)
{
#if defined(_SILICON_LABS_32B_SERIES_1)
  *(volatile uint32_t*)0x400E303C |= 0x00000040UL;
  return SL_EFPDRV_OK;

#else
#warning "Internal LDO disable not implemented for this device family."
  EFM_ASSERT(false);
  return SL_EFPDRV_NOT_SUPPORTED;
#endif
}

/***************************************************************************//**
 * @brief
 *   Write EFP control register.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[in] data
 *   The value to write to the register.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_write_register(uint8_t addr, uint8_t data)
{
  I2C_TransferSeq_TypeDef seq = {
    .addr   = EFPDRV_EFP01_I2C_ADDR,
    .flags  = I2C_FLAG_WRITE_WRITE,
    .buf[0] = { .data = &addr, .len = 1 },
    .buf[1] = { .data = &data, .len = 1 }
  };

  if (in_direct_mode) {
    enable_i2c_pins(true);
  }

  if (I2CSPM_Transfer(init_data.i2c_instance, &seq) != i2cTransferDone) {
    EFM_ASSERT(false);
    return SL_EFPDRV_I2C_ERROR;
  }
  return SL_EFPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *   Write EFP control register field.
 *
 * @note
 *   This function performs a read-modify-write of a EFP register.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[in] data
 *   The value to write to the register field.
 *
 * @param[in] mask
 *   Bit mask corresponding to target bit field.
 *
 * @param[in] pos
 *   Bit number of least significant bit of target bit field.
 *
 * @return
 *   SL_EFPDRV_OK or SL_EFPDRV_I2C_ERROR on I2C transfer errors.
 ******************************************************************************/
int sl_efpdrv_write_register_field(uint8_t addr,
                                   uint8_t data,
                                   uint8_t mask,
                                   uint8_t pos)
{
  int ret_val;
  uint8_t tmp;

  ret_val = sl_efpdrv_read_register(addr, &tmp);
  if (ret_val == SL_EFPDRV_OK) {
    tmp = (tmp & ~mask) | ((data << pos) & mask);
    ret_val = sl_efpdrv_write_register(addr, tmp);
  }
  return ret_val;
}

/** @} (end addtogroup SL_EFPDRV) */
/** @} (end group kitdrv) */
